fooapi-serilog/out/results.txt
Running 20s test @ http://api/weatherforecast
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    47.84ms   44.68ms 800.53ms   96.54%
    Req/Sec   739.82    224.97     1.91k    70.88%
  Latency Distribution
     50%   41.46ms
     75%   53.07ms
     90%   67.91ms
     99%  167.46ms
  168059 requests in 20.10s, 105.98MB read
Requests/sec:   8361.59
Transfer/sec:      5.27MB